# StairsWinderInvalidParamsFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsWinderInvalidParamsFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot create the winder run because some values for the instance properties cannot be satisfied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsWinderInvalidParamsFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsWinderInvalidParamsFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsWinderInvalidParamsFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace